[
  {
    "id": "P1-001",
    "phase": "P1: Local Dev Environment",
    "title": "Set up Docker Compose with PostgreSQL for local development",
    "description": "Update docker-compose.yml to include a local PostgreSQL service (postgres:16-alpine) with health checks, volume persistence, and proper env vars. Add a .env.local template with DATABASE_URL pointing to the local DB. Ensure `just db-migrate` works against local DB.",
    "status": "done",
    "dependencies": []
  },
  {
    "id": "P1-002",
    "phase": "P1: Local Dev Environment",
    "title": "Create local development container setup with mocks",
    "description": "Create src/container.local.ts that sets up DI container for local development: uses real DB, mocks spreadsheet repositories (no-op), mocks Monobank gateway (returns empty), mocks PubSub. Reuse all database repositories directly (skip dual-write). Create a MockSpreadsheetsClient, MockBankGateway, MockPubSubClient.",
    "status": "done",
    "dependencies": ["P1-001"]
  },
  {
    "id": "P1-003",
    "phase": "P1: Local Dev Environment",
    "title": "Create local dev server entry point",
    "description": "Create src/server.ts as the main entry point for the local dev web server. It should: load .env, set up local container, start HTTP server on configurable port (default 4001). Add `just dev-server` command to justfile. This will later host both the webhook endpoints AND GraphQL.",
    "status": "done",
    "dependencies": ["P1-002"]
  },
  {
    "id": "P1-004",
    "phase": "P1: Local Dev Environment",
    "title": "Add seed script for local database",
    "description": "Create scripts/seed-local-db.ts that seeds the local DB with realistic test data: 5 accounts (3 operational, 2 savings), 23 categories (hierarchical), 15 budgets (mix of spending/savings/goal), 45 allocations across 3 months, 186 transactions across 3 months. Add `just db-seed` to justfile.",
    "status": "done",
    "dependencies": ["P1-001"]
  },

  {
    "id": "P2-001",
    "phase": "P2: GraphQL API Foundation",
    "title": "Install GraphQL dependencies and configure Apollo Server",
    "description": "Install @apollo/server, graphql, @graphql-tools/schema. Create src/modules/graphql/ module with ApolloServer setup that integrates with the existing Bun HttpServer. Set up basic schema with Query type and health check query. Wire into the dev server entry point at /graphql endpoint.",
    "status": "done",
    "dependencies": ["P1-003"]
  },
  {
    "id": "P2-002",
    "phase": "P2: GraphQL API Foundation",
    "title": "Define GraphQL schema for Accounts",
    "description": "Create src/presentation/graphql/schema/accounts.graphql with Account type, AccountRole enum, AccountType enum. Add Query { accounts, account(id: Int!) }. Create AccountResolver in src/presentation/graphql/resolvers/AccountResolver.ts that reads from AccountRepository. Register in schema.",
    "status": "done",
    "dependencies": ["P2-001"]
  },
  {
    "id": "P2-003",
    "phase": "P2: GraphQL API Foundation",
    "title": "Define GraphQL schema for Budgets with CRUD mutations",
    "description": "Create budgets.graphql with Budget type, BudgetType enum, queries (budgets, budget(id)), mutations (createBudget, updateBudget, archiveBudget). Create BudgetResolver. Implement CreateBudget and UpdateBudget use cases in application layer.",
    "status": "done",
    "dependencies": ["P2-001"]
  },
  {
    "id": "P2-004",
    "phase": "P2: GraphQL API Foundation",
    "title": "Define GraphQL schema for Categories with CRUD mutations",
    "description": "Create categories.graphql with Category type (including parent/children hierarchy), CategoryStatus enum, queries (categories, category(id)), mutations (createCategory, updateCategory, archiveCategory). Create CategoryResolver. Implement use cases.",
    "status": "done",
    "dependencies": ["P2-001"]
  },
  {
    "id": "P2-005",
    "phase": "P2: GraphQL API Foundation",
    "title": "Define GraphQL schema for Allocations with CRUD mutations",
    "description": "Create allocations.graphql with Allocation type, queries (allocations(budgetId, period)), mutations (createAllocation, updateAllocation, deleteAllocation, moveFunds(sourceBudgetId, destBudgetId, amount, period)). Create AllocationResolver. Implement use cases. moveFunds creates two allocations atomically.",
    "status": "done",
    "dependencies": ["P2-001"]
  },
  {
    "id": "P2-006",
    "phase": "P2: GraphQL API Foundation",
    "title": "Define GraphQL schema for Transactions with queries",
    "description": "Create transactions.graphql with Transaction type, TransactionType enum, CategorizationStatus enum. Add queries: transactions(filters: TransactionFilter), transaction(id). Add mutations: updateTransactionCategory, updateTransactionBudget, verifyTransaction. Create TransactionResolver with pagination support. Add child resolvers for account, category, budget fields.",
    "status": "done",
    "dependencies": ["P2-001"]
  },
  {
    "id": "P2-007",
    "phase": "P2: GraphQL API Foundation",
    "title": "Implement Monthly Overview computed query",
    "description": "Add GraphQL query monthlyOverview(month: String!) that returns: readyToAssign, totalAllocated, totalSpent, capitalBalance, availableFunds, savingsRate. Also returns budgetSummaries[] with per-budget: allocated, spent, available, carryover. Implement BudgetCalculationService in domain layer with pure computation logic per PRD.",
    "status": "done",
    "dependencies": ["P2-005", "P2-006"]
  },
  {
    "id": "P2-008",
    "phase": "P2: GraphQL API Foundation",
    "title": "Add Accounts CRUD mutations with sync field protection",
    "description": "Add mutations: createAccount, updateAccount, archiveAccount. Accounts can be created manually (for non-Monobank banks, cash accounts, etc.). Add 'source' enum field (bank_sync | manual) to Account. For synced accounts (source = 'bank_sync'), disallow editing protected fields (IBAN, currency). Manual accounts can be fully edited. Implement CreateAccount, UpdateAccount, ArchiveAccount use cases with appropriate validation.",
    "status": "done",
    "dependencies": ["P2-002", "TX-001"]
  },
  {
    "id": "P2-009",
    "phase": "P2: GraphQL API Foundation",
    "title": "Add createTransaction mutation for manual accounts",
    "description": "Add createTransaction mutation for adding transactions to manual (non-synced) accounts. Required fields: accountId, amount, date, description. Optional: categoryId, budgetId. Validate that target account is not synced. Implement CreateTransaction use case.",
    "status": "todo",
    "dependencies": ["P2-006", "P2-008"]
  },
  {
    "id": "P2-010",
    "phase": "P2: GraphQL API Foundation",
    "title": "Add WebSocket subscriptions infrastructure",
    "description": "Set up GraphQL subscriptions using graphql-ws. Add subscriptions for: monthlyOverviewUpdated, budgetUpdated, allocationUpdated, transactionUpdated. Return full entity types (not custom types) for cache updates. Configure Apollo Server with WebSocket support. Update frontend Apollo Client to use WebSocket link.",
    "status": "todo",
    "dependencies": ["P2-007", "TX-006"]
  },
  {
    "id": "P2-011",
    "phase": "P2: GraphQL API Foundation",
    "title": "Research and improve GraphQL schema management",
    "description": "Current schema uses readFileSync to load .graphql files. Research best practices for schema management (code-first vs schema-first, type generation, schema stitching). Consider if current approach is optimal or needs refactoring. Document decision in ADR.",
    "status": "todo",
    "dependencies": []
  },

  {
    "id": "P3-001",
    "phase": "P3: Next.js Frontend Setup",
    "title": "Initialize Next.js app with ShadCN UI and Tailwind CSS",
    "description": "Create web/ directory with Next.js 14+ app (App Router). Install and configure: Tailwind CSS, ShadCN UI (init with default theme), Apollo Client, graphql-codegen. Set up path aliases. Configure proxy to backend API at localhost:4000/graphql. Add `just dev-web` to justfile.",
    "status": "done",
    "dependencies": ["P2-001"]
  },
  {
    "id": "P3-002",
    "phase": "P3: Next.js Frontend Setup",
    "title": "Set up GraphQL code generation for frontend",
    "description": "Install @graphql-codegen/cli, @graphql-codegen/client-preset, @graphql-codegen/typescript-operations. Configure codegen.ts to read .graphql files from web/src/graphql/ and generate typed hooks/documents. Add `just codegen` command. Create initial .graphql operation files for accounts query.",
    "status": "done",
    "dependencies": ["P3-001", "P2-002"]
  },
  {
    "id": "P3-003",
    "phase": "P3: Next.js Frontend Setup",
    "title": "Create app layout with navigation sidebar",
    "description": "Build main layout with sidebar navigation (like YNAB): Budget overview (main page), Accounts list, Transactions list, Settings. Use ShadCN sidebar component. Include month selector in header. Dark theme support. Responsive design.",
    "status": "done",
    "dependencies": ["P3-001"]
  },
  {
    "id": "P3-004",
    "phase": "P3: Next.js Frontend Setup",
    "title": "Create basic auth gate (single user, email-only)",
    "description": "Implement a simple auth gate: on first load, check localStorage for authenticated email. If not present, show login form that accepts only the owner's email (configured via env var ALLOWED_EMAIL). No password - just email verification for now. Store in localStorage. Protect all routes.",
    "status": "todo",
    "dependencies": ["P3-003"]
  },
  {
    "id": "P3-005",
    "phase": "P3: Next.js Frontend Setup",
    "title": "Update Next.js to v16",
    "description": "Upgrade Next.js from 15.3.0 to latest v16.1.x. Use `npx @next/codemod@canary upgrade latest`. Update eslint-config-next accordingly. Test build and dev server. Handle any breaking changes (routing, caching, React 19.2 features). Verify all pages work correctly after upgrade.",
    "status": "todo",
    "dependencies": ["TX-007"]
  },
  {
    "id": "P3-006",
    "phase": "P3: Next.js Frontend Setup",
    "title": "Remove GraphQL proxy and use direct API",
    "description": "Remove the Next.js rewrite that proxies /api/graphql to localhost:4001. Configure Apollo Client to connect directly to the API server. Update CORS configuration on backend to allow frontend origin. Update any documentation referencing the proxy.",
    "status": "todo",
    "dependencies": ["TX-007"]
  },
  {
    "id": "P3-007",
    "phase": "P3: Next.js Frontend Setup",
    "title": "Add frontend to just check command",
    "description": "Update justfile `check` command to include frontend type checking and linting: run `cd web && bun run lint && tsc --noEmit`. Ensure both backend and frontend quality checks run together. Consider adding parallel execution for speed.",
    "status": "todo",
    "dependencies": ["TX-007"]
  },
  {
    "id": "P3-008",
    "phase": "P3: Next.js Frontend Setup",
    "title": "Document frontend environment configuration",
    "description": "Create web/.env.example with all required environment variables (API URL, etc.). Document frontend configuration in README or CLAUDE.md. Update local setup instructions to include frontend env setup.",
    "status": "todo",
    "dependencies": ["TX-007"]
  },
  {
    "id": "P3-009",
    "phase": "P3: Next.js Frontend Setup",
    "title": "Add codegen to onboarding workflow",
    "description": "Update CLAUDE.md and any setup documentation to mention `just codegen` as part of the initial setup process. Add to REVIEW-SUMMARY.md 'How to Run Locally' section. Consider running codegen automatically as part of `just dev-web`.",
    "status": "todo",
    "dependencies": ["TX-007"]
  },
  {
    "id": "P3-010",
    "phase": "P3: Next.js Frontend Setup",
    "title": "Research Biome for frontend",
    "description": "Research migrating frontend from ESLint to Biome for consistency with backend. Key requirements: cyclomatic complexity rule (noExcessiveCognitiveComplexity), JSX support with sensible defaults. Evaluate trade-offs. If viable, create follow-up task to migrate. Document decision.",
    "status": "todo",
    "dependencies": ["TX-007"]
  },

  {
    "id": "P4-001",
    "phase": "P4: Budget Overview Page (Main Feature)",
    "title": "Build Monthly Overview header with key metrics",
    "description": "Create the Budget page (main page) header section showing: month selector (prev/next arrows + month name), Ready to Assign (with color coding: green=0, yellow>0, red<0), Capital (savings), Available Funds, Total Allocated, Total Spent, Savings Rate. Use monthlyOverview GraphQL query. YNAB-style design.",
    "status": "done",
    "dependencies": ["P3-003", "P2-007"]
  },
  {
    "id": "P4-002",
    "phase": "P4: Budget Overview Page (Main Feature)",
    "title": "Build Budget table with inline allocation editing",
    "description": "Create the budget table showing all active budgets for selected month: Budget name, Target/Limit, Allocated (editable inline), Spent, Available (with color), Progress bar. Support inline editing of allocated amount (click to edit, creates allocation). Group budgets by type (Spending, Savings, Goals). YNAB-style UX.",
    "status": "done",
    "dependencies": ["P4-001", "P2-003", "P2-005"]
  },
  {
    "id": "P4-003",
    "phase": "P4: Budget Overview Page (Main Feature)",
    "title": "Implement Move Funds dialog",
    "description": "Create a dialog/modal for moving funds between budgets: select source budget, destination budget, amount. Uses moveFunds mutation. Shows current available balance for source. Updates table immediately via Apollo cache.",
    "status": "done",
    "dependencies": ["P4-002"]
  },
  {
    "id": "P4-004",
    "phase": "P4: Budget Overview Page (Main Feature)",
    "title": "Build Budget CRUD dialogs (create, edit, archive)",
    "description": "Create dialogs for: New Budget (name, type, target amount, cadence, dates), Edit Budget, Archive Budget (with confirmation). Use ShadCN Dialog, Form, Select components. Validate inputs with Zod on client side.",
    "status": "todo",
    "dependencies": ["P4-002", "TX-006"]
  },
  {
    "id": "P4-005",
    "phase": "P4: Budget Overview Page (Main Feature)",
    "title": "Build Unbudgeted Transactions warning section",
    "description": "Below the budget table, show a warning section listing expense transactions from operational accounts that have no budget assigned for the selected month. Show date, amount, description, account. Allow quick budget assignment from this list.",
    "status": "todo",
    "dependencies": ["P4-002", "P2-006", "TX-006"]
  },
  {
    "id": "P4-006",
    "phase": "P4: Budget Overview Page (Main Feature)",
    "title": "Add optimistic responses to mutations",
    "description": "Implement optimistic responses for all frontend mutations: createAllocation, updateAllocation, moveFunds, createBudget, updateBudget. Use Apollo Client optimisticResponse option. Ensure immediate UI feedback before server confirmation. Handle rollback on errors gracefully.",
    "status": "todo",
    "dependencies": ["P4-003", "TX-006"]
  },

  {
    "id": "P5-001",
    "phase": "P5: Accounts & Transactions Pages",
    "title": "Build Accounts page with CRUD for manual accounts",
    "description": "Create Accounts page showing all accounts grouped by role (Operational, Savings). For each account: name, type badge, currency, balance, IBAN (truncated), last sync time, synced indicator. Show total balance per group. Add 'Add Account' button for creating manual accounts. Synced accounts show read-only details. Manual accounts can be edited/archived.",
    "status": "todo",
    "dependencies": ["P3-003", "P2-008", "TX-006"]
  },
  {
    "id": "P5-002",
    "phase": "P5: Accounts & Transactions Pages",
    "title": "Build Transactions page with filtering and pagination",
    "description": "Create Transactions page with: filterable table (date range, account, category, budget, search text, status), pagination, sortable columns. Show: date, description, amount (color by type), category, budget, status badge. Click row to expand details.",
    "status": "todo",
    "dependencies": ["P3-003", "P2-006", "TX-006"]
  },
  {
    "id": "P5-003",
    "phase": "P5: Accounts & Transactions Pages",
    "title": "Build Transaction detail/edit panel",
    "description": "When a transaction is clicked, show a side panel or expanded row with full details. Allow editing: category (dropdown with search), budget (dropdown with search), notes. Show AI reasoning if available. Add Verify button to confirm categorization. For manual account transactions, allow full editing including amount and date.",
    "status": "todo",
    "dependencies": ["P5-002", "P2-004", "P2-009"]
  },

  {
    "id": "P6-001",
    "phase": "P6: Categories Management",
    "title": "Build Categories management page",
    "description": "Create Categories page showing hierarchical category tree. Support: create category (with optional parent), rename, archive. Show transaction count per category. Tree view with expand/collapse. ShadCN Tree or custom accordion component.",
    "status": "todo",
    "dependencies": ["P3-003", "P2-004", "TX-006"]
  },

  {
    "id": "P7-001",
    "phase": "P7: API Integration Tests",
    "title": "Set up API integration test infrastructure",
    "description": "Create tests/integration/api/ directory. Set up test harness that: starts local Postgres (from docker-compose), runs migrations, creates Apollo Server instance with test container (mocked spreadsheet/bank), provides helpers to seed data and make GraphQL queries. Use Bun test runner. Add factory functions for creating test entities.",
    "status": "todo",
    "dependencies": ["P2-001", "P1-004"]
  },
  {
    "id": "P7-002",
    "phase": "P7: API Integration Tests",
    "title": "Write API integration tests for core queries and mutations",
    "description": "Write integration tests for: accounts query, budgets CRUD, categories CRUD, allocations CRUD, moveFunds mutation, transactions query with filters, monthlyOverview computation. Each test seeds data, executes query/mutation, asserts response.",
    "status": "todo",
    "dependencies": ["P7-001", "P2-007"]
  },

  {
    "id": "P8-001",
    "phase": "P8: E2E Tests (Playwright)",
    "title": "Set up Playwright E2E test infrastructure with structured fixtures",
    "description": "Install Playwright and configure e2e/ directory. Create docker-compose.e2e.yml that spins up fresh PostgreSQL, runs migrations, seeds test data, starts API server (with mocked Monobank/spreadsheet), and starts Next.js. Configure playwright.config.ts with baseURL, timeout, retries. Create base test fixtures using Playwright's test.extend() for: fresh database state per test file, API client for direct DB manipulation, authenticated page context. Add `just test-e2e` command that orchestrates the full stack. Create e2e/fixtures/ for test data factories and e2e/utils/ for helpers.",
    "status": "todo",
    "dependencies": ["P4-002", "P5-002"]
  },
  {
    "id": "P8-002",
    "phase": "P8: E2E Tests (Playwright)",
    "title": "Create Page Objects and reusable component classes",
    "description": "Create Page Object Model (POM) pattern in e2e/pages/: BasePage (common selectors, wait utilities), BudgetPage (budget table, metrics, move funds dialog), TransactionsPage (filters, table, pagination), AccountsPage (account groups, CRUD dialogs), CategoriesPage (tree view, CRUD). Create reusable component classes in e2e/components/: Table (row selection, sorting), Dialog (open/close, form submit), MonthSelector (navigate months), InlineEditor (edit/save/cancel). All selectors use data-qa attributes (e.g., [data-qa='budget-table'], [data-qa='move-funds-btn']). Add data-qa attributes to frontend components as needed.",
    "status": "todo",
    "dependencies": ["P8-001"]
  },
  {
    "id": "P8-003",
    "phase": "P8: E2E Tests (Playwright)",
    "title": "Write E2E tests for Budget Overview page",
    "description": "Clean, high-level tests using Page Objects. Tests: verify metrics display correct values (Ready to Assign, Capital, etc.), navigate months and verify data changes, edit allocation inline and verify totals update, move funds between budgets via dialog, create new budget via dialog, archive budget and verify removal from list. Each test uses fixture data and calls high-level methods like budgetPage.editAllocation('Groceries', 500), budgetPage.moveFunds('Groceries', 'Savings', 100). Assert via page object getters like budgetPage.readyToAssign.",
    "status": "todo",
    "dependencies": ["P8-002"]
  },
  {
    "id": "P8-004",
    "phase": "P8: E2E Tests (Playwright)",
    "title": "Write E2E tests for Transactions and Accounts pages",
    "description": "Clean, high-level tests using Page Objects. Transactions tests: load page with default filters, filter by date range, filter by category/budget, search by description, paginate through results, edit transaction category via dropdown, edit transaction budget, verify transaction. Accounts tests: verify accounts grouped by role, create manual account via dialog, edit manual account name, archive manual account, verify synced accounts show read-only badge, verify archived accounts hidden by default.",
    "status": "todo",
    "dependencies": ["P8-002"]
  },

  {
    "id": "P9-001",
    "phase": "P9: GCP Deployment",
    "title": "Configure Cloud Run Service for web app",
    "description": "Update Terraform to deploy the web server as a Cloud Run Service (alongside existing webhook service). Configure: Dockerfile multi-stage build for Next.js + API, env vars, secrets, IAM. Set up custom domain or Cloud Run URL. Update CI/CD pipeline.",
    "status": "todo",
    "dependencies": ["P4-005", "P5-003"]
  },

  {
    "id": "TX-001",
    "phase": "TX: Technical Debt",
    "title": "Fix architecture dependency rule violations",
    "description": "Fix presentation layer importing from infrastructure. In transactionsResolver.ts and monthlyOverviewResolver.ts: create domain-level TransactionRepository methods (e.g., findTransactionSummaries, findByFilters) instead of importing DatabaseTransactionRepository directly. Move TransactionFilterParams to domain layer. Resolvers should only import from domain/application layers.",
    "status": "done",
    "dependencies": []
  },
  {
    "id": "TX-002",
    "phase": "TX: Technical Debt",
    "title": "Fix typecasting violations in mappers",
    "description": "Replace `as SomeType` assertions with proper type guards or Zod validation in: DatabaseBudgetMapper.ts (BudgetType, TargetCadence casts), DatabaseAccountMapper.ts (AccountRole cast), GraphQLServer.ts (double cast through unknown). Use Zod schemas or type guard functions for safe runtime type narrowing.",
    "status": "done",
    "dependencies": []
  },
  {
    "id": "TX-003",
    "phase": "TX: Technical Debt",
    "title": "Add tests for DatabaseAllocationMapper",
    "description": "Create tests/unit/infrastructure/mappers/DatabaseAllocationMapper.test.ts. Test toDomain() mapping from DB row to Allocation entity. Test toRow() mapping from entity to DB row. Test edge cases: null values, boundary dates, various amount values.",
    "status": "done",
    "dependencies": []
  },
  {
    "id": "TX-004",
    "phase": "TX: Technical Debt",
    "title": "Add tests for DualWrite repositories",
    "description": "Create tests for DualWriteBudgetRepository and DualWriteCategoryRepository (following pattern from existing DualWriteTransactionRepository.test.ts and DualWriteAccountRepository.test.ts). Test that both database and spreadsheet repositories are called. Test error handling when one write fails.",
    "status": "done",
    "dependencies": []
  },
  {
    "id": "TX-005",
    "phase": "TX: Technical Debt",
    "title": "Extract shared GraphQL mapping utilities",
    "description": "Consolidate duplicate budget/allocation mapping code across resolvers. Create src/presentation/graphql/mappers/ directory with: BudgetGqlMapper, AllocationGqlMapper, TransactionGqlMapper. Move mapBudgetToGql, toMinorUnits, BUDGET_TYPE_TO_GQL constants to shared location. Update all resolvers to use shared mappers.",
    "status": "done",
    "dependencies": []
  },
  {
    "id": "TX-006",
    "phase": "TX: Technical Debt",
    "title": "Refactor resolvers to be injectable classes",
    "description": "Refactor GraphQL resolvers from plain objects to injectable classes. Create base Resolver class (similar to Controller pattern). Resolvers should: be decorated with @injectable(), receive dependencies via constructor, map inputs and invoke use cases (no business logic). Create separate Query/Mutation resolver classes if needed for organization.",
    "status": "done",
    "dependencies": ["TX-001", "TX-005"]
  },
  {
    "id": "TX-007",
    "phase": "TX: Technical Debt",
    "title": "Frontend infrastructure improvements",
    "description": "Meta-task for frontend infrastructure. Completed when P3-005 through P3-010 are done. This ensures frontend tooling is solid before building more UI features.",
    "status": "todo",
    "dependencies": []
  },
  {
    "id": "TX-008",
    "phase": "TX: Technical Debt",
    "title": "Auto-verify transaction when user edits category or budget",
    "description": "When user manually updates a transaction's category or budget via updateTransactionCategory or updateTransactionBudget mutations, automatically set categorizationStatus to VERIFIED. This confirms that the user has reviewed and accepted the categorization (even if they changed it). Currently these mutations don't update the status. Filter by 'categorized' status to see LLM-categorized transactions that need review.",
    "status": "todo",
    "dependencies": []
  }
]
